[{
   "id": "1581376324100",
   "title": "Bootcamps VS Self-taught",
   "content": "I personally feel that I got to experience both ends when it comes to learning web development and, while I can't confirm one is better than the other, here are my thoughts. \n\n I first started bootcamp in October of 2018. \n\nPROS \n - I had to allocate time aside to attend class / code \n - If I had any questions, I was able to ask the teachers, teacher aids or other classmates for any help. \n - We covered A LOT of subjects regarding the web development world. \n\n CONS \n - We covered A LOT of subjects. \n - Bootcamps can cost a alot of money \n - It can be overwelming. \n - You will be learning something new at the beginning of the week, extend on it midweek and have a homework assignment to complete the following week based on what you just learned WHILE, touching on something new. \n\n I graduated the bootcamp in April of 2019. Now at this point I had just recently received a promotion at work. I began working closely with one of the founders of the company and for that reason, decided to put web developement down while I worked and focused on my new responsibilities. I started picking up on Web Development again towards the end of 2019. \n\nPROS \n - So much free content online for new, intermediate and advanced students.  \n - You can find amazing teachers who have great online courses for very cheap. \n - Videos / reading material is available for you to pause and review as many times as you'd like so that you can firmly understand the subject. \n - You will learn to problem solve and search for answers. \n\n CONS \n - Since you don't have to attend any classes to physically be at, you must set time in you own schedule to learn. \n - More distractions (family, friends, social media). \n - No immediate assitance if you have questions. \n - It can be overwhelming due to the fact that there is so much content which can lead to confusion. \n\n If anyone was to ask me which method I would recommend, I would with no question answer 'Self Teach'. Now I understand that there are many different ways that people as individuals seem to learn a new skill better. I firmly believed that I needed a be in a classroom environment in order to learn which is why I went the bootcampt route. I have found that teaching yourself how to code will: \n - Help you create good habits. \n - Teach you how to problem solve and google questions which is a very important skill to have in this industry. \n\n Regardless of which way anyone decides to go, get ready. This will be challeneing BUT very rewarding in the end.",
   "post_image": "uploads/post-image-1581376324096.png",
   "added_date": "1581376324100"
}, {
   "id": "1581375207401",
   "title": "Why Web Development?",
   "content": "Technology is changing the world. Every day people are looking at simple day to day actions and looking for simplier / quicker ways of doing it. \n Most of the time, we don't even know that something can be simplified until someone finds a way \nAs a result, I believe the web developers and tech engineers will be in high demand as the world continues to grow.",
   "post_image": "uploads/post-image-1581375207393.jpg",
   "added_date": "1581375207401"
}]